
exports.menu = (pushname, prefix, getLevelingLevel, getLevelingXp, sender, reqXp, _registered, uangkau, role, per) => {
	return`
╔══✪〘 INFORMATION 〙✪๑᩿⸙۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪ࣤ࿐
█
█╠ீ҉͜ৡৢ͜͡➣╣ *Hi, ${pushname}👋*
█╠ீ҉͜ৡৢ͜͡➣╣ *Name:* *ZEUS BOT*
█╠ீ҉͜ৡৢ͜͡➣╣ *Owner:* *Its Me Vinzz* :)
█╠ீ҉͜ৡৢ͜͡➣╣ *No:* wa.me/6285964224017
█╠ீ҉͜ৡৢ͜͡➣╣ *Partner:* *NgudiangNE*
█╠ீ҉͜ৡৢ͜͡➣╣ *No partner:* *wa.me/6285858753211
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
*   .        °  •     *       .      ☆        .°   .  °  •*
╭ ࿉۟࣪࣪᭝ꔛ⃟⿻ྀ⃕ꪆ᭡࿔ •˚✯ཻ ࿉۟࣪࣪ ̥•━━━━•⊱ ٜٜٜٜٜٜٜ҈ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ ٜٜٜٜٜٜٜ҈ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ✦•
┃╭┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅         
┃┋            *THANKS TO*
┃┋ *TUHAN*ꔛ⃟⿻ྀ⃕ꪆ᭡࿔࿐
┃┋┈─․ೇ︨︧ཾ❍⃝⃘۪۪۪͡ꪆ᭡࿔   ⨾ ✩̣̣̣̣̣ͯ
┃┋ *Its Me Vinzz*ꔛ⃟⿻ྀ⃕ꪆ᭡࿔࿐
┃┋┈─․ೇ︨︧ཾ❍⃝⃘۪۪۪͡ꪆ᭡࿔  ⨾
┃┋ *NgudiangNE*ꔛ⃟⿻ྀ⃕ꪆ᭡࿔࿐˚๑᩿⸙۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪۪ࣤ࿐
┃┋┈─․ೇ︨︧ཾ❍⃝⃘۪۪۪͡ꪆ᭡࿔   ⨾
┃┋ *APAJA*ꔛ⃟⿻ྀ⃕ꪆ᭡࿔࿐
┃┋┈─․ೇ︨︧ཾ❍⃝⃘۪۪۪͡ꪆ᭡࿔   ⨾
┃┋ *LIA*ꔛ⃟⿻ྀ⃕ꪆ᭡࿔࿐
┃┋┈─․ೇ︨︧ཾ❍⃝⃘۪۪۪͡ꪆ᭡࿔   ⨾
┃┋ *AGAN TUTORIAL*ꔛ⃟⿻ྀ⃕ꪆ᭡࿔࿐
┃┋┈─․ೇ︨︧ཾ❍⃝⃘۪۪۪͡ꪆ᭡࿔   ⨾
┃┋ *DAPPA UHUY*ꔛ⃟⿻ྀ⃕ꪆ᭡࿔࿐
┃┋ ✩̣̣̣̣̣ͯ
┃┋┈─․ೇ︨︧ཾ❍⃝⃘۪۪۪͡ꪆ᭡࿔   ⨾         
┃┋ *ALL OWNER BOT*         ✩̣̣̣̣̣ͯ           
┃╰┅┅┅┅┅┅┅┅┅┅┅┅ *˚✯ཻ࿉۟࣪࣪ ̥•┉•⊱✦•*        
╰꫶——————————————————
 *   .        °  •     *       .      ☆     *   .°   .  °  •*

❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ USER ₊˚✧*
││
││ꓸ᭄ꦿ⃔➪  Register: ✓
││ꓸ᭄ꦿ⃔➪  Prefix: ${prefix}
││ꓸ᭄ꦿ⃔➪  Security: ${per}
││ꓸ᭄ꦿ⃔➪  Rank: ${role}
││ꓸ᭄ꦿ⃔➪  Versi Wa: 2.21.5.17
││ꓸ᭄ꦿ⃔➪  Server: _Baileys_
││ꓸ᭄ꦿ⃔➪  Nomor: wa.me/${sender.split("@")[0]}
││ꓸ᭄ꦿ⃔➪  Uang Mu: Rp${uangkau}
││ꓸ᭄ꦿ⃔➪  Xp: ${getLevelingXp(sender)}/${reqXp}
││ꓸ᭄ꦿ⃔➪  Level: ${getLevelingLevel(sender)}
││ꓸ᭄ꦿ⃔➪  User Register: ${_registered.length}
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ LIST MENU ₊˚✧*
││
││ꓸ᭄ꦿ⃔➪  *${prefix}ownermenu*
││ꓸ᭄ꦿ⃔➪  *${prefix}groupmenu*
││ꓸ᭄ꦿ⃔➪  *${prefix}nsfwmenu*
││ꓸ᭄ꦿ⃔➪  *${prefix}funmenu*
││ꓸ᭄ꦿ⃔➪  *${prefix}mediamenu*
││ꓸ᭄ꦿ⃔➪  *${prefix}animemenu*
││ꓸ᭄ꦿ⃔➪  *${prefix}soundmenu*
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ OTHER ₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}setprefix*
││ꓸ᭄ꦿ⃔➪ *${prefix}suratto*
││ꓸ᭄ꦿ⃔➪ *${prefix}daftar nama|umur*
││ꓸ᭄ꦿ⃔➪ *${prefix}lapor [KELUHAN]*
││ꓸ᭄ꦿ⃔➪ *${prefix}request [FITUR]*
││ꓸ᭄ꦿ⃔➪ *${prefix}info*
││ꓸ᭄ꦿ⃔➪ *${prefix}limit*
││ꓸ᭄ꦿ⃔➪ *${prefix}buylimit*
││ꓸ᭄ꦿ⃔➪ *${prefix}dompet*
││ꓸ᭄ꦿ⃔➪ *${prefix}rules*
││ꓸ᭄ꦿ⃔➪ *${prefix}donasi*
││ꓸ᭄ꦿ⃔➪ *${prefix}ping*
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ SERTIFIKAT₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}surgaserti [TEXT]*	
││ꓸ᭄ꦿ⃔➪ *${prefix}goodboyserti  [TEXT]*	
││ꓸ᭄ꦿ⃔➪ *${prefix}pinterserti  [TEXT]*	
││ꓸ᭄ꦿ⃔➪ *${prefix}badboyserti  [TEXT]*	
││ꓸ᭄ꦿ⃔➪ *${prefix}goodlokingserti  [TEXT]*
││ꓸ᭄ꦿ⃔➪ *${prefix}editodserti  [TEXT]*	
││ꓸ᭄ꦿ⃔➪ *${prefix}anakharamserti  [TEXT]*	
││ꓸ᭄ꦿ⃔➪ *${prefix}babuserti  [TEXT]*	
││ꓸ᭄ꦿ⃔➪ *${prefix}youtuberserti* [2/3/4/5]
││ꓸ᭄ꦿ⃔➪ *${prefix}fftourserti5* [2/3/4/5]
││ꓸ᭄ꦿ⃔➪ *${prefix}mltourserti* [2/3/4/5]				
││ꓸ᭄ꦿ⃔➪ *${prefix}pubgtourserti* [2/3/4/5]
││
││ ࿉۟࣪࣪᭝ꔛ⃟ZEUS BOT⿻ྀ⃕ꪆ᭡࿔࿐𖤐 ﻿°• ﻿
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
`
}

exports.funmenu = (prefix) => {
	return`
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ KERANG MENU / DLL₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}apakah [TEXT]*
││ꓸ᭄ꦿ⃔➪ *${prefix}kapankah [TEXT]*
││ꓸ᭄ꦿ⃔➪ *${prefix}rate*
││ꓸ᭄ꦿ⃔➪ *${prefix}babi*
││ꓸ᭄ꦿ⃔➪ *${prefix}doraemon*
││ꓸ᭄ꦿ⃔➪ *${prefix}anjing*
││ꓸ᭄ꦿ⃔➪ *${prefix}kucing*
││ꓸ᭄ꦿ⃔➪ *${prefix}hamster*
││ꓸ᭄ꦿ⃔➪ *${prefix}kelinci*
││
││ ࿉۟࣪࣪᭝ꔛ⃟ZEUS BOT⿻ྀ⃕ꪆ᭡࿔࿐𖤐 ﻿°• ﻿
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
`
}

exports.animemenu = (prefix) => {
	return`
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ ANIME MENU₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}animewallpaper*
││ꓸ᭄ꦿ⃔➪ *${prefix}loli*
││ꓸ᭄ꦿ⃔➪ *${prefix}loli1*
││ꓸ᭄ꦿ⃔➪ *${prefix}neko*
││ꓸ᭄ꦿ⃔➪ *${prefix}waifu*
││ꓸ᭄ꦿ⃔➪ *${prefix}shota*
││ꓸ᭄ꦿ⃔➪ *${prefix}husbu*
││ꓸ᭄ꦿ⃔➪ *${prefix}shinobu*
││ꓸ᭄ꦿ⃔➪ *${prefix}megumin*
││ꓸ᭄ꦿ⃔➪ *${prefix}wallnime*
││ꓸ᭄ꦿ⃔➪ *${prefix}senku*
││ꓸ᭄ꦿ⃔➪ *${prefix}nekonime*
││ꓸ᭄ꦿ⃔➪ *${prefix}kurumi*
││ꓸ᭄ꦿ⃔➪ *${prefix}wibu*
││ꓸ᭄ꦿ⃔➪ *${prefix}nhentai*
││
││ ࿉۟࣪࣪᭝ꔛ⃟ZEUS BOT⿻ྀ⃕ꪆ᭡࿔࿐𖤐 ﻿°• ﻿
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
`
}

exports.ownermenu = (prefix) => {
	return`
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ OWNER MENU₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}bc*
││ꓸ᭄ꦿ⃔➪ *${prefix}bcgc*
││ꓸ᭄ꦿ⃔➪ *${prefix}setlimit*
││ꓸ᭄ꦿ⃔➪ *${prefix}setprefix*
││ꓸ᭄ꦿ⃔➪ *${prefix}clearall*
││ꓸ᭄ꦿ⃔➪ *${prefix}ban*
││ꓸ᭄ꦿ⃔➪ *${prefix}unban*
││ꓸ᭄ꦿ⃔➪ *${prefix}block*
││ꓸ᭄ꦿ⃔➪ *${prefix}unblock*
││ꓸ᭄ꦿ⃔➪ *${prefix}addbadword* <teks>
││ꓸ᭄ꦿ⃔➪ *${prefix}listbadword*
││ꓸ᭄ꦿ⃔➪ *${prefix}nobadword*
││ꓸ᭄ꦿ⃔➪ *${prefix}leave :(*
││ꓸ᭄ꦿ⃔➪ *${prefix}event* [1/0]
││ꓸ᭄ꦿ⃔➪ *${prefix}clone*
││ꓸ᭄ꦿ⃔➪ *${prefix}tagall :(*
││
││ ࿉۟࣪࣪᭝ꔛ⃟ZEUS BOT⿻ྀ⃕ꪆ᭡࿔࿐𖤐 ﻿°• ﻿
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
`
}

exports.mediamenu = (prefix) => {
	return`
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ MEDIA MENU₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}brainly*
││ꓸ᭄ꦿ⃔➪ *${prefix}ytplay*
││ꓸ᭄ꦿ⃔➪ *${prefix}ytmp4*
││ꓸ᭄ꦿ⃔➪ *${prefix}ytmp3*
││ꓸ᭄ꦿ⃔➪ *${prefix}imgurl*
││ꓸ᭄ꦿ⃔➪ *${prefix}meme*
││ꓸ᭄ꦿ⃔➪ *${prefix}memeindo*
││ꓸ᭄ꦿ⃔➪ *${prefix}tts*
││ꓸ᭄ꦿ⃔➪ *${prefix}play*
││ꓸ᭄ꦿ⃔➪ *${prefix}lirik*
││ꓸ᭄ꦿ⃔➪ *${prefix}afk*
││ꓸ᭄ꦿ⃔➪ *${prefix}unafk*
││ꓸ᭄ꦿ⃔➪ *${prefix}asupan*
││
││ ࿉۟࣪࣪᭝ꔛ⃟ZEUS BOT⿻ྀ⃕ꪆ᭡࿔࿐𖤐 ﻿°• ﻿
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
`
}

exports.groupmenu = (prefix) => {
	return`
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ GROUP MENU₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}ganteng*
││ꓸ᭄ꦿ⃔➪ *${prefix}cantik*
││ꓸ᭄ꦿ⃔➪ *${prefix}jelek*
││ꓸ᭄ꦿ⃔➪ *${prefix}goblok*
││ꓸ᭄ꦿ⃔➪ *${prefix}bego*
││ꓸ᭄ꦿ⃔➪ *${prefix}pinter*
││ꓸ᭄ꦿ⃔➪ *${prefix}jago*
││ꓸ᭄ꦿ⃔➪ *${prefix}nolep*
││ꓸ᭄ꦿ⃔➪ *${prefix}babi*
││ꓸ᭄ꦿ⃔➪ *${prefix}beban*
││ꓸ᭄ꦿ⃔➪ *${prefix}baik*
││ꓸ᭄ꦿ⃔➪ *${prefix}jahat*
││ꓸ᭄ꦿ⃔➪ *${prefix}haram*
││ꓸ᭄ꦿ⃔➪ *${prefix}kontol*
││ꓸ᭄ꦿ⃔➪ *${prefix}pakboy*
││ꓸ᭄ꦿ⃔➪ *${prefix}pakgirl*
││ꓸ᭄ꦿ⃔➪ *${prefix}sadboy
││ꓸ᭄ꦿ⃔➪ *${prefix}sadgirl*
││ꓸ᭄ꦿ⃔➪ *${prefix}wibu*
││ꓸ᭄ꦿ⃔➪ *${prefix}hebat*
││ꓸ᭄ꦿ⃔➪ *${prefix}hidetag*
││ꓸ᭄ꦿ⃔➪ *${prefix}del*
││ꓸ᭄ꦿ⃔➪ *${prefix}jadian*
││ꓸ᭄ꦿ⃔➪ *${prefix}ngewe*
││ꓸ᭄ꦿ⃔➪ *${prefix}level*
││ꓸ᭄ꦿ⃔➪ *${prefix}leaderboard*
││ꓸ᭄ꦿ⃔➪ *${prefix}linkgc*
││ꓸ᭄ꦿ⃔➪ *${prefix}tagall* //no work
││ꓸ᭄ꦿ⃔➪ *${prefix}setpp*
││ꓸ᭄ꦿ⃔➪ *${prefix}add*
││ꓸ᭄ꦿ⃔➪ *${prefix}kick*
││ꓸ᭄ꦿ⃔➪ *${prefix}setname*
││ꓸ᭄ꦿ⃔➪ *${prefix}setdesc*
││ꓸ᭄ꦿ⃔➪ *${prefix}demote*
││ꓸ᭄ꦿ⃔➪ *${prefix}promote*
││ꓸ᭄ꦿ⃔➪ *${prefix}listadmin*
││ꓸ᭄ꦿ⃔➪ *${prefix}closegc*
││ꓸ᭄ꦿ⃔➪ *${prefix}opengc*
││ꓸ᭄ꦿ⃔➪ *${prefix}leveling*
││ꓸ᭄ꦿ⃔➪ *${prefix}nsfw* [1/0]
││ꓸ᭄ꦿ⃔➪ *${prefix}simih* [1/0]
││ꓸ᭄ꦿ⃔➪ *${prefix}welcome* [1/0]
││ꓸ᭄ꦿ⃔➪ *${prefix}antilinkgrup* [1/0]
││ꓸ᭄ꦿ⃔➪ *${prefix}antivirtex* [1/0]	
││
││ ࿉۟࣪࣪᭝ꔛ⃟ZEUS BOT⿻ྀ⃕ꪆ᭡࿔࿐𖤐 ﻿°• ﻿
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
`
}

exports.nsfwmenu = (prefix) => {
	return`
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ NSFW🔞₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}nsfwloli*
││ꓸ᭄ꦿ⃔➪ *${prefix}nsfwneko*
││ꓸ᭄ꦿ⃔➪ *${prefix}nsfwtrap*
││ꓸ᭄ꦿ⃔➪ *${prefix}nsfwpussy*
││ꓸ᭄ꦿ⃔➪ *${prefix}nsfwyuri*
││ꓸ᭄ꦿ⃔➪ *${prefix}nsfwloli2*
││ꓸ᭄ꦿ⃔➪ *${prefix}sideoppai*
││ꓸ᭄ꦿ⃔➪ *${prefix}nsfwwaifu*
││ꓸ᭄ꦿ⃔➪ *${prefix}ecchi*
││ꓸ᭄ꦿ⃔➪ *${prefix}nekopoi* <judul>
││
││ ࿉۟࣪࣪᭝ꔛ⃟ZEUS BOT⿻ྀ⃕ꪆ᭡࿔࿐𖤐 ﻿°• ﻿
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
`
}

exports.soundmenu = (prefix) => {
	return`
❍ָིི۪⃕۫͜*
│╭── ིᮭᬼ ⃡⃝───────────────*
││        ீ҉͜ৡৢ͜͡➣🗒 ❛ SOUND MENU₊˚
││   
││ꓸ᭄ꦿ⃔➪ *${prefix}sound1*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound2*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound3*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound4*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound5*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound6*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound7*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound8*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound9*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound10*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound11*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound12*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound13*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound14*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound15*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound16*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound17*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound18*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound19*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound20*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound21*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound22*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound23*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound24*
││ꓸ᭄ꦿ⃔➪ *${prefix}sound25*
││ꓸ᭄ꦿ⃔➪ *${prefix}djpota*
││
││ ࿉۟࣪࣪᭝ꔛ⃟ZEUS BOT⿻ྀ⃕ꪆ᭡࿔࿐𖤐 ﻿°• ﻿
*█╚━═━❊━═━❊━═━❊━═━❊━═━*
`
}